<?php

return [
    'greeting' => "Здравствуйте, Добро пожаловать в Baraka почтовый бот!",
    'login' => '🔓Вход в систему',
    'track_number' => '🚚 Ввод трек-номера',
    'order_payment' => '📦 Оплата | Заказ',
    'delivery_address' => '🚩 Адрес доставки',
    'china_address' => '🇨🇳 Наш адрес в Китае',
    'call_center' => '📞 Call center',
    'profile' => '👤 Профиль',
    'feedback' => '💬 Отзывы',
    'phone' => [
        'enter' => 'Введите ваш номер телефона без кода страны, например: 912345678',
        'wrong' => 'Неверный номер телефона, пожалуйста, попробуйте еще раз!
Без кода страны, например: 912345678',
    ],
    'otp' => [
        'your_code' => 'Ваш код подтверждения: :code',
        'enter' => 'Введите SMS-код:',
        'wrong' => 'Неверный код, пожалуйста, попробуйте еще раз!',
        'expired' => 'Срок действия кода истек, пожалуйста, попробуйте еще раз!',
    ],
    'full_name' => [
        'enter' => 'Введите ваше полное имя и фамилию, разделенные пробелом.
Пример: Асрор Суннатиллаев',
        'wrong' => 'Неверное имя, пожалуйста, попробуйте еще раз!',
    ],
    'address' => [
        'enter' => 'Введите ваш адрес проживания.
Пример: город Ташкент, Мирзо-Улугбекский район, улица Истиклол, дом 32',
    ],
    'registration' => [
        'success' => 'Регистрация успешно завершена!',
        'details' => "🆔 Код: :id\n👤 Имя: :name\n📱 Номер телефона: :phone\n📍 Адрес: :address\n📅 Дата регистрации: :date",
    ],
];
